////预处理，程序在运行前，需要提前做的事
//#include <stdio.h>
////程序的主入口
//int main()
//{
//	
//	//打印语句，打印""里面的内容
//	/*
//	printf(参数1,  参数2);
//	参数1：最终输出的样式，为字符串
//	参数2：可以用各种占位符填充的内容
//	占位符：
//	整型常量：
//		>>%d：	打印整数
//		>>%ld：	打印long类型占位符
//		>>%lld：打印long long类型占位符
//		>>%zu：	打印sizeof返回结果占位符
//		>>%u：	打印无符号整数占位符
//	实型常量：%f
//	字符常量：%c
//	字符串常量：%s
//	其他：
//		>>%p：	打印16进制整数
//	*/
//	printf("我学校名字为：%s", "河南农业大学\n");
//	printf("我高考总分为：%d分\n", 578);
//	int a = 1;
//	printf("%d\n", a);
//	float b = 1;
//	printf("%d", a + b);
//
//
//
//
//
//
//	/*
//	1.表示程序的结束
//	2.0表示程序正常运行
//	3.0这是和上面的int呼应起来了
//	*/
//	return 0;
//} 